     IPARAM       DS
     I                                    B   1   40COLOR
     I                                    B   5   80OUTLIN
     I                                    B   9  120ATTYPE
     I                                    B  13  160ATMOD
     I                                    B  17  200COUNT
     C                     CALL 'GDDM'
     C                     PARM 'FSINIT ' RTN     8
     C                     CALL 'GDDM'
     C                     PARM 'GSCOL  ' RTN
     C                     PARM 1         COLOR
     C                     CALL 'GDDM'
     C                     PARM 'GSMOVE ' RTN
     C                     PARM 5         X       51
     C                     PARM 5         Y       51
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 95        X
     C                     PARM 5         Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 95        X
     C                     PARM 95        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 5         X
     C                     PARM 95        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 5         X
     C                     PARM 5         Y
     C                     CALL 'GDDM'
     C                     PARM 'GSCOL  ' RTN
     C                     PARM 2         COLOR
     C                     CALL 'GDDM'
     C                     PARM 'GSMOVE ' RTN
     C                     PARM 12        X
     C                     PARM 12        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 35        X
     C                     PARM 12        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 35        X
     C                     PARM 35        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 12        X
     C                     PARM 35        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 12        X
     C                     PARM 12        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSCOL  ' RTN
     C                     PARM 4         COLOR
     C                     CALL 'GDDM'
     C                     PARM 'GSMOVE ' RTN
     C                     PARM 39        X
     C                     PARM 12        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 61        X
     C                     PARM 12        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 50        X
     C                     PARM 36        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 39        X
     C                     PARM 12        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSCOL  ' RTN
     C                     PARM 5         COLOR
     C                     CALL 'GDDM'
     C                     PARM 'GSMOVE ' RTN
     C                     PARM 76        X
     C                     PARM 10        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 91        X
     C                     PARM 24        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 76        X
     C                     PARM 38        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 61        X
     C                     PARM 24        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 76        X
     C                     PARM 10        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSCOL  ' RTN
     C                     PARM 6         COLOR
     C                     CALL 'GDDM'
     C                     PARM 'GSMOVE ' RTN
     C                     PARM 50        X
     C                     PARM 88        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 55        X
     C                     PARM 72        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 72        X
     C                     PARM 72        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 59        X
     C                     PARM 62        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 64        X
     C                     PARM 46        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 50        X
     C                     PARM 56        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 36        X
     C                     PARM 46        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 41        X
     C                     PARM 62        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 28        X
     C                     PARM 72        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 45        X
     C                     PARM 72        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 50        X
     C                     PARM 88        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSCOL  ' RTN
     C                     PARM 3         COLOR
     C                     CALL 'GDDM'
     C                     PARM 'GSMOVE ' RTN
     C                     PARM 10        X
     C                     PARM 50        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 10        X
     C                     PARM 72        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 18        X
     C                     PARM 84        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 26        X
     C                     PARM 72        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 26        X
     C                     PARM 50        Y
     C                     CALL 'GDDM'
     C                     PARM 'GSLINE ' RTN
     C                     PARM 10        X
     C                     PARM 50        Y
     C                     CALL 'GDDM'
     C                     PARM 'ASREAD ' RTN
     C                     PARM 0         ATTYPE
     C                     PARM           ATMOD
     C                     PARM           COUNT
     C                     CALL 'GDDM'
     C                     PARM 'FSTERM ' RTN
     C                     SETON                     LR
     C                     RETRN
